export const SERVER_ADDRESS = 'mc.lytrix.ru';
export const SERVER_NAME = 'LytriX';
export const DOWNLOAD_LINK = '#';

export const SOCIAL_LINKS = {
    TELEGRAM: '#',
    DISCORD: '#',
    YOUTUBE: '#'
};

export const RULES = {
    '0. Общие': {
        '0.1': 'Играя на серверах нашего проекта вы автоматически соглашаетесь с данным сводом правил',
        '0.2': 'Администрация может выносить наказания на свое усмотрение в том числе по причинам не указанным в правилах',
        '0.3': 'Правила могут менятся в любое время, игроки не обязаны быть уведомлены о изменениях'
    },
    '1. Чат': {
        '1.1': 'Запрещено использование бранных слов',
        '1.2': 'Запрещена любого рода реклама',
        '1.3': 'Запрещен флуд, спам'
    },
    '2. Игровой процесс': {
        '2.1': 'Запрещено уничтожать, портить постройки других игроков без их прямого согласия',
        '2.2': 'Запрещено использование читов, модов, ресурс паков и прочего, что прямо или косвенно упрощает игровой процесс или дает преимещество перед другими игроками'
    },
    '3. Аккаунт': {
        '3.1': 'Запрещено передавать данные игрового аккаунта третьим лицам'
    },
    '4. Прочее': {
        '4.1': 'Запрещено намеренно наносить какой-либо вред серверу. Будь то DOS/DDOS атаки, попытки взлома или краша сервера'
    }
} as const;